docs/posts/2015-11-15-a-prayerful-response.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Prayerful Response</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">A Prayerful Response</h1>
<p class="subtitle" role="doc-subtitle">Nov 15, 2015</p>
</header><p>
<i>As we mourn for the lives lost this week in Paris, Lord, hear our prayer.</i>
</p>

<p>
Almighty God,
</p>

<p>
We grieve this week,<br>
crying with those who suffer,<br>
lamenting with those who mourn.
</p>

<p>
Even in our anger,<br>
May we always seek justice,<br>
and never revenge;<br>
healing, not harm;<br>
and a measured response,<br>
instead of thoughtless reaction.
</p>

<p>
When circumstances tempt us<br>
to sink into the depths of despair,<br>
may we hear the prophet&rsquo;s voice,<br>
as he surveyed the destruction of Jerusalem<br>
yet still found hope,
</p>

<p>
&ldquo;The steadfast love of the Lord never ceases,<br>
his mercies never come to an end;<br>
they are new every morning,<br>
great is your faithfulness.&rdquo;
</p>

<p>
When faced with the choice<br>
between burning hatred<br>
and callous indifference,<br>
remind us again that there is a third way,<br>
the way of love.
</p>

<p>
And may that love shine so brightly<br>
that the entire world will know,<br>
the light still shines in the darkness,<br>
and the darkness will never defeat it.
</p>

<p>
<i>Amen</i>
</p>



<div class="tagline" id="org497d694">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
